smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*******************************************************************************
 * HW_CAU_DIRECT9 - Direct access register 9
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT9 - Direct access register 9 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct9
{
    uint32_t U;
    struct _hw_cau_direct9_bitfields
    {
        uint32_t CAU_DIRECT9b : 32;    /*!< [31:0] Direct register 9 */
    } B;
} hw_cau_direct9_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT9 register
 */
/*@{*/
#define HW_CAU_DIRECT9_ADDR(x)   ((uintptr_t)(x) + 0x24U)

#define HW_CAU_DIRECT9(x)        (*(__O hw_cau_direct9_t *) HW_CAU_DIRECT9_ADDR(x))
#define HW_CAU_DIRECT9_WR(x, v)  (HW_CAU_DIRECT9(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT9 bitfields
 */

/*!
 * @name Register CAU_DIRECT9, field CAU_DIRECT9[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT9_CAU_DIRECT9 (0U)    /*!< Bit position for CAU_DIRECT9_CAU_DIRECT9. */
#define BM_CAU_DIRECT9_CAU_DIRECT9 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT9_CAU_DIRECT9. */
#define BS_CAU_DIRECT9_CAU_DIRECT9 (32U)   /*!< Bit field size in bits for CAU_DIRECT9_CAU_DIRECT9. */

/*! @brief Format value for bitfield CAU_DIRECT9_CAU_DIRECT9. */
#define BF_CAU_DIRECT9_CAU_DIRECT9(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT9_CAU_DIRECT9) & BM_CAU_DIRECT9_CAU_DIRECT9)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT10 - Direct access register 10
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT10 - Direct access register 10 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct10
{
    uint32_t U;
    struct _hw_cau_direct10_bitfields
    {
        uint32_t CAU_DIRECT10b : 32;   /*!< [31:0] Direct register 10 */
    } B;
} hw_cau_direct10_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT10 register
 */
/*@{*/
#define HW_CAU_DIRECT10_ADDR(x)  ((uintptr_t)(x) + 0x28U)

#define HW_CAU_DIRECT10(x)       (*(__O hw_cau_direct10_t *) HW_CAU_DIRECT10_ADDR(x))
#define HW_CAU_DIRECT10_WR(x, v) (HW_CAU_DIRECT10(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT10 bitfields
 */

/*!
 * @name Register CAU_DIRECT10, field CAU_DIRECT10[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT10_CAU_DIRECT10 (0U)  /*!< Bit position for CAU_DIRECT10_CAU_DIRECT10. */
#define BM_CAU_DIRECT10_CAU_DIRECT10 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT10_CAU_DIRECT10. */
#define BS_CAU_DIRECT10_CAU_DIRECT10 (32U) /*!< Bit field size in bits for CAU_DIRECT10_CAU_DIRECT10. */

/*! @brief Format value for bitfield CAU_DIRECT10_CAU_DIRECT10. */
#define BF_CAU_DIRECT10_CAU_DIRECT10(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT10_CAU_DIRECT10) & BM_CAU_DIRECT10_CAU_DIRECT10)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT11 - Direct access register 11
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT11 - Direct access register 11 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct11
{
    uint32_t U;
    struct _hw_cau_direct11_bitfields
    {
        uint32_t CAU_DIRECT11b : 32;   /*!< [31:0] Direct register 11 */
    } B;
} hw_cau_direct11_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT11 register
 */
/*@{*/
#define HW_CAU_DIRECT11_ADDR(x)  ((uintptr_t)(x) + 0x2CU)

#define HW_CAU_DIRECT11(x)       (*(__O hw_cau_direct11_t *) HW_CAU_DIRECT11_ADDR(x))
#define HW_CAU_DIRECT11_WR(x, v) (HW_CAU_DIRECT11(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT11 bitfields
 */

/*!
 * @name Register CAU_DIRECT11, field CAU_DIRECT11[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT11_CAU_DIRECT11 (0U)  /*!< Bit position for CAU_DIRECT11_CAU_DIRECT11. */
#define BM_CAU_DIRECT11_CAU_DIRECT11 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT11_CAU_DIRECT11. */
#define BS_CAU_DIRECT11_CAU_DIRECT11 (32U) /*!< Bit field size in bits for CAU_DIRECT11_CAU_DIRECT11. */

/*! @brief Format value for bitfield CAU_DIRECT11_CAU_DIRECT11. */
#define BF_CAU_DIRECT11_CAU_DIRECT11(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT11_CAU_DIRECT11) & BM_CAU_DIRECT11_CAU_DIRECT11)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT12 - Direct access register 12
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT12 - Direct access register 12 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct12
{
    uint32_t U;
    struct _hw_cau_direct12_bitfields
    {
        uint32_t CAU_DIRECT12b : 32;   /*!< [31:0] Direct register 12 */
    } B;
} hw_cau_direct12_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT12 register
 */
/*@{*/
#define HW_CAU_DIRECT12_ADDR(x)  ((uintptr_t)(x) + 0x30U)

#define HW_CAU_DIRECT12(x)       (*(__O hw_cau_direct12_t *) HW_CAU_DIRECT12_ADDR(x))
#define HW_CAU_DIRECT12_WR(x, v) (HW_CAU_DIRECT12(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT12 bitfields
 */

/*!
 * @name Register CAU_DIRECT12, field CAU_DIRECT12[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT12_CAU_DIRECT12 (0U)  /*!< Bit position for CAU_DIRECT12_CAU_DIRECT12. */
#define BM_CAU_DIRECT12_CAU_DIRECT12 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT12_CAU_DIRECT12. */
#define BS_CAU_DIRECT12_CAU_DIRECT12 (32U) /*!< Bit field size in bits for CAU_DIRECT12_CAU_DIRECT12. */

/*! @brief Format value for bitfield CAU_DIRECT12_CAU_DIRECT12. */
#define BF_CAU_DIRECT12_CAU_DIRECT12(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT12_CAU_DIRECT12) & BM_CAU_DIRECT12_CAU_DIRECT12)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT13 - Direct access register 13
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT13 - Direct access register 13 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct13
{
    uint32_t U;
    struct _hw_cau_direct13_bitfields
    {
        uint32_t CAU_DIRECT13b : 32;   /*!< [31:0] Direct register 13 */
    } B;
} hw_cau_direct13_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT13 register
 */
/*@{*/
#define HW_CAU_DIRECT13_ADDR(x)  ((uintptr_t)(x) + 0x34U)

#define HW_CAU_DIRECT13(x)       (*(__O hw_cau_direct13_t *) HW_CAU_DIRECT13_ADDR(x))
#define HW_CAU_DIRECT13_WR(x, v) (HW_CAU_DIRECT13(x).U = (v))
/*@}*/

