smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*******************************************************************************
 * HW_CAU_LDR_CA8 - General Purpose Register 8 - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CA8 - General Purpose Register 8 - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_ca8
{
    uint32_t U;
    struct _hw_cau_ldr_ca8_bitfields
    {
        uint32_t CA8 : 32;             /*!< [31:0] CA8 */
    } B;
} hw_cau_ldr_ca8_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CA8 register
 */
/*@{*/
#define HW_CAU_LDR_CA8_ADDR(x)   ((uintptr_t)(x) + 0x868U)

#define HW_CAU_LDR_CA8(x)        (*(__O hw_cau_ldr_ca8_t *) HW_CAU_LDR_CA8_ADDR(x))
#define HW_CAU_LDR_CA8_WR(x, v)  (HW_CAU_LDR_CA8(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CA8 bitfields
 */

/*!
 * @name Register CAU_LDR_CA8, field CA8[31:0] (WO)
 */
/*@{*/
#define BP_CAU_LDR_CA8_CA8   (0U)          /*!< Bit position for CAU_LDR_CA8_CA8. */
#define BM_CAU_LDR_CA8_CA8   (0xFFFFFFFFU) /*!< Bit mask for CAU_LDR_CA8_CA8. */
#define BS_CAU_LDR_CA8_CA8   (32U)         /*!< Bit field size in bits for CAU_LDR_CA8_CA8. */

/*! @brief Format value for bitfield CAU_LDR_CA8_CA8. */
#define BF_CAU_LDR_CA8_CA8(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CA8_CA8) & BM_CAU_LDR_CA8_CA8)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CASR - Status register  - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CASR - Status register  - Store Register command (RO)
 *
 * Reset value: 0x20000000U
 */
typedef union _hw_cau_str_casr
{
    uint32_t U;
    struct _hw_cau_str_casr_bitfields
    {
        uint32_t IC : 1;               /*!< [0]  */
        uint32_t DPE : 1;              /*!< [1]  */
        uint32_t RESERVED0 : 26;       /*!< [27:2]  */
        uint32_t VER : 4;              /*!< [31:28] CAU version */
    } B;
} hw_cau_str_casr_t;

/*!
 * @name Constants and macros for entire CAU_STR_CASR register
 */
/*@{*/
#define HW_CAU_STR_CASR_ADDR(x)  ((uintptr_t)(x) + 0x880U)

#define HW_CAU_STR_CASR(x)       (*(__I hw_cau_str_casr_t *) HW_CAU_STR_CASR_ADDR(x))
#define HW_CAU_STR_CASR_RD(x)    (HW_CAU_STR_CASR(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CASR bitfields
 */

/*!
 * @name Register CAU_STR_CASR, field IC[0] (RO)
 *
 * Values:
 * - 0 - No illegal commands issued
 * - 1 - Illegal command issued
 */
/*@{*/
#define BP_CAU_STR_CASR_IC   (0U)          /*!< Bit position for CAU_STR_CASR_IC. */
#define BM_CAU_STR_CASR_IC   (0x00000001U) /*!< Bit mask for CAU_STR_CASR_IC. */
#define BS_CAU_STR_CASR_IC   (1U)          /*!< Bit field size in bits for CAU_STR_CASR_IC. */

/*! @brief Read current value of the CAU_STR_CASR_IC field. */
#define BR_CAU_STR_CASR_IC(x) (HW_CAU_STR_CASR(x).B.IC)
/*@}*/

/*!
 * @name Register CAU_STR_CASR, field DPE[1] (RO)
 *
 * Values:
 * - 0 - No error detected
 * - 1 - DES key parity error detected
 */
/*@{*/
#define BP_CAU_STR_CASR_DPE  (1U)          /*!< Bit position for CAU_STR_CASR_DPE. */
#define BM_CAU_STR_CASR_DPE  (0x00000002U) /*!< Bit mask for CAU_STR_CASR_DPE. */
#define BS_CAU_STR_CASR_DPE  (1U)          /*!< Bit field size in bits for CAU_STR_CASR_DPE. */

/*! @brief Read current value of the CAU_STR_CASR_DPE field. */
#define BR_CAU_STR_CASR_DPE(x) (HW_CAU_STR_CASR(x).B.DPE)
/*@}*/

/*!
 * @name Register CAU_STR_CASR, field VER[31:28] (RO)
 *
 * Values:
 * - 0001 - Initial CAU version
 * - 0010 - Second version, added support for SHA-256 algorithm.(This is the
 *     value on this device)
 */
/*@{*/
#define BP_CAU_STR_CASR_VER  (28U)         /*!< Bit position for CAU_STR_CASR_VER. */
#define BM_CAU_STR_CASR_VER  (0xF0000000U) /*!< Bit mask for CAU_STR_CASR_VER. */
#define BS_CAU_STR_CASR_VER  (4U)          /*!< Bit field size in bits for CAU_STR_CASR_VER. */

/*! @brief Read current value of the CAU_STR_CASR_VER field. */
#define BR_CAU_STR_CASR_VER(x) (HW_CAU_STR_CASR(x).B.VER)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CAA - Accumulator register - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CAA - Accumulator register - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_caa
{
    uint32_t U;
    struct _hw_cau_str_caa_bitfields
    {
        uint32_t ACC : 32;             /*!< [31:0] ACC */
    } B;
} hw_cau_str_caa_t;

/*!
 * @name Constants and macros for entire CAU_STR_CAA register
 */
/*@{*/
#define HW_CAU_STR_CAA_ADDR(x)   ((uintptr_t)(x) + 0x884U)

#define HW_CAU_STR_CAA(x)        (*(__I hw_cau_str_caa_t *) HW_CAU_STR_CAA_ADDR(x))
#define HW_CAU_STR_CAA_RD(x)     (HW_CAU_STR_CAA(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CAA bitfields
 */

/*!
 * @name Register CAU_STR_CAA, field ACC[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CAA_ACC   (0U)          /*!< Bit position for CAU_STR_CAA_ACC. */
#define BM_CAU_STR_CAA_ACC   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CAA_ACC. */
#define BS_CAU_STR_CAA_ACC   (32U)         /*!< Bit field size in bits for CAU_STR_CAA_ACC. */

/*! @brief Read current value of the CAU_STR_CAA_ACC field. */
#define BR_CAU_STR_CAA_ACC(x) (HW_CAU_STR_CAA(x).U)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CA0 - General Purpose Register 0 - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CA0 - General Purpose Register 0 - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_ca0
{
    uint32_t U;
    struct _hw_cau_str_ca0_bitfields
    {
        uint32_t CA0 : 32;             /*!< [31:0] CA0 */
    } B;
} hw_cau_str_ca0_t;

/*!
 * @name Constants and macros for entire CAU_STR_CA0 register
 */
/*@{*/
#define HW_CAU_STR_CA0_ADDR(x)   ((uintptr_t)(x) + 0x888U)

#define HW_CAU_STR_CA0(x)        (*(__I hw_cau_str_ca0_t *) HW_CAU_STR_CA0_ADDR(x))
#define HW_CAU_STR_CA0_RD(x)     (HW_CAU_STR_CA0(x).U)
/*@}*/

