smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*! @brief Format value for bitfield CAU_ADR_CA1_CA1. */
#define BF_CAU_ADR_CA1_CA1(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA1_CA1) & BM_CAU_ADR_CA1_CA1)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca2
{
    uint32_t U;
    struct _hw_cau_adr_ca2_bitfields
    {
        uint32_t CA2 : 32;             /*!< [31:0] CA2 */
    } B;
} hw_cau_adr_ca2_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA2 register
 */
/*@{*/
#define HW_CAU_ADR_CA2_ADDR(x)   ((uintptr_t)(x) + 0x8D0U)

#define HW_CAU_ADR_CA2(x)        (*(__O hw_cau_adr_ca2_t *) HW_CAU_ADR_CA2_ADDR(x))
#define HW_CAU_ADR_CA2_WR(x, v)  (HW_CAU_ADR_CA2(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA2 bitfields
 */

/*!
 * @name Register CAU_ADR_CA2, field CA2[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA2_CA2   (0U)          /*!< Bit position for CAU_ADR_CA2_CA2. */
#define BM_CAU_ADR_CA2_CA2   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA2_CA2. */
#define BS_CAU_ADR_CA2_CA2   (32U)         /*!< Bit field size in bits for CAU_ADR_CA2_CA2. */

/*! @brief Format value for bitfield CAU_ADR_CA2_CA2. */
#define BF_CAU_ADR_CA2_CA2(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA2_CA2) & BM_CAU_ADR_CA2_CA2)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA3 - General Purpose Register 3 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA3 - General Purpose Register 3 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca3
{
    uint32_t U;
    struct _hw_cau_adr_ca3_bitfields
    {
        uint32_t CA3 : 32;             /*!< [31:0] CA3 */
    } B;
} hw_cau_adr_ca3_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA3 register
 */
/*@{*/
#define HW_CAU_ADR_CA3_ADDR(x)   ((uintptr_t)(x) + 0x8D4U)

#define HW_CAU_ADR_CA3(x)        (*(__O hw_cau_adr_ca3_t *) HW_CAU_ADR_CA3_ADDR(x))
#define HW_CAU_ADR_CA3_WR(x, v)  (HW_CAU_ADR_CA3(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA3 bitfields
 */

/*!
 * @name Register CAU_ADR_CA3, field CA3[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA3_CA3   (0U)          /*!< Bit position for CAU_ADR_CA3_CA3. */
#define BM_CAU_ADR_CA3_CA3   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA3_CA3. */
#define BS_CAU_ADR_CA3_CA3   (32U)         /*!< Bit field size in bits for CAU_ADR_CA3_CA3. */

/*! @brief Format value for bitfield CAU_ADR_CA3_CA3. */
#define BF_CAU_ADR_CA3_CA3(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA3_CA3) & BM_CAU_ADR_CA3_CA3)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA4 - General Purpose Register 4 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA4 - General Purpose Register 4 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca4
{
    uint32_t U;
    struct _hw_cau_adr_ca4_bitfields
    {
        uint32_t CA4 : 32;             /*!< [31:0] CA4 */
    } B;
} hw_cau_adr_ca4_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA4 register
 */
/*@{*/
#define HW_CAU_ADR_CA4_ADDR(x)   ((uintptr_t)(x) + 0x8D8U)

#define HW_CAU_ADR_CA4(x)        (*(__O hw_cau_adr_ca4_t *) HW_CAU_ADR_CA4_ADDR(x))
#define HW_CAU_ADR_CA4_WR(x, v)  (HW_CAU_ADR_CA4(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA4 bitfields
 */

/*!
 * @name Register CAU_ADR_CA4, field CA4[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA4_CA4   (0U)          /*!< Bit position for CAU_ADR_CA4_CA4. */
#define BM_CAU_ADR_CA4_CA4   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA4_CA4. */
#define BS_CAU_ADR_CA4_CA4   (32U)         /*!< Bit field size in bits for CAU_ADR_CA4_CA4. */

/*! @brief Format value for bitfield CAU_ADR_CA4_CA4. */
#define BF_CAU_ADR_CA4_CA4(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA4_CA4) & BM_CAU_ADR_CA4_CA4)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA5 - General Purpose Register 5 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA5 - General Purpose Register 5 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca5
{
    uint32_t U;
    struct _hw_cau_adr_ca5_bitfields
    {
        uint32_t CA5 : 32;             /*!< [31:0] CA5 */
    } B;
} hw_cau_adr_ca5_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA5 register
 */
/*@{*/
#define HW_CAU_ADR_CA5_ADDR(x)   ((uintptr_t)(x) + 0x8DCU)

#define HW_CAU_ADR_CA5(x)        (*(__O hw_cau_adr_ca5_t *) HW_CAU_ADR_CA5_ADDR(x))
#define HW_CAU_ADR_CA5_WR(x, v)  (HW_CAU_ADR_CA5(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ADR_CA5 bitfields
 */

/*!
 * @name Register CAU_ADR_CA5, field CA5[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ADR_CA5_CA5   (0U)          /*!< Bit position for CAU_ADR_CA5_CA5. */
#define BM_CAU_ADR_CA5_CA5   (0xFFFFFFFFU) /*!< Bit mask for CAU_ADR_CA5_CA5. */
#define BS_CAU_ADR_CA5_CA5   (32U)         /*!< Bit field size in bits for CAU_ADR_CA5_CA5. */

/*! @brief Format value for bitfield CAU_ADR_CA5_CA5. */
#define BF_CAU_ADR_CA5_CA5(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ADR_CA5_CA5) & BM_CAU_ADR_CA5_CA5)
/*@}*/

/*******************************************************************************
 * HW_CAU_ADR_CA6 - General Purpose Register 6 - Add to register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ADR_CA6 - General Purpose Register 6 - Add to register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_adr_ca6
{
    uint32_t U;
    struct _hw_cau_adr_ca6_bitfields
    {
        uint32_t CA6 : 32;             /*!< [31:0] CA6 */
    } B;
} hw_cau_adr_ca6_t;

/*!
 * @name Constants and macros for entire CAU_ADR_CA6 register
 */
/*@{*/
#define HW_CAU_ADR_CA6_ADDR(x)   ((uintptr_t)(x) + 0x8E0U)

#define HW_CAU_ADR_CA6(x)        (*(__O hw_cau_adr_ca6_t *) HW_CAU_ADR_CA6_ADDR(x))
#define HW_CAU_ADR_CA6_WR(x, v)  (HW_CAU_ADR_CA6(x).U = (v))
/*@}*/

