smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*! @brief Read current value of the FTFL_FCCOBA_CCOBn field. */
#define BR_FTFL_FCCOBA_CCOBn(x) (HW_FTFL_FCCOBA(x).U)

/*! @brief Format value for bitfield FTFL_FCCOBA_CCOBn. */
#define BF_FTFL_FCCOBA_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOBA_CCOBn) & BM_FTFL_FCCOBA_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOBA_CCOBn(x, v) (HW_FTFL_FCCOBA_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB9 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB9 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob9
{
    uint8_t U;
    struct _hw_ftfl_fccob9_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob9_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB9 register
 */
/*@{*/
#define HW_FTFL_FCCOB9_ADDR(x)   ((uintptr_t)(x) + 0xEU)

#define HW_FTFL_FCCOB9(x)        (*(__IO hw_ftfl_fccob9_t *) HW_FTFL_FCCOB9_ADDR(x))
#define HW_FTFL_FCCOB9_RD(x)     (HW_FTFL_FCCOB9(x).U)
#define HW_FTFL_FCCOB9_WR(x, v)  (HW_FTFL_FCCOB9(x).U = (v))
#define HW_FTFL_FCCOB9_SET(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) |  (v)))
#define HW_FTFL_FCCOB9_CLR(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) & ~(v)))
#define HW_FTFL_FCCOB9_TOG(x, v) (HW_FTFL_FCCOB9_WR(x, HW_FTFL_FCCOB9_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCCOB9 bitfields
 */

/*!
 * @name Register FTFL_FCCOB9, field CCOBn[7:0] (RW)
 *
 * The FCCOB register provides a command code and relevant parameters to the
 * memory controller. The individual registers that compose the FCCOB data set can
 * be written in any order, but you must provide all needed values, which vary
 * from command to command. First, set up all required FCCOB fields and then
 * initiate the command's execution by writing a 1 to the FSTAT[CCIF] bit. This clears
 * the CCIF bit, which locks all FCCOB parameter fields and they cannot be changed
 * by the user until the command completes (CCIF returns to 1). No command
 * buffering or queueing is provided; the next command can be loaded only after the
 * current command completes. Some commands return information to the FCCOB
 * registers. Any values returned to FCCOB are available for reading after the
 * FSTAT[CCIF] flag returns to 1 by the memory controller. The following table shows a
 * generic flash command format. The first FCCOB register, FCCOB0, always contains
 * the command code. This 8-bit value defines the command to be executed. The
 * command code is followed by the parameters required for this specific flash
 * command, typically an address and/or data values. The command parameter table is
 * written in terms of FCCOB Number (which is equivalent to the byte number). This
 * number is a reference to the FCCOB register name and is not the register
 * address. FCCOB Number Typical Command Parameter Contents [7:0] 0 FCMD (a code that
 * defines the flash command) 1 Flash address [23:16] 2 Flash address [15:8] 3
 * Flash address [7:0] 4 Data Byte 0 5 Data Byte 1 6 Data Byte 2 7 Data Byte 3 8
 * Data Byte 4 9 Data Byte 5 A Data Byte 6 B Data Byte 7 FCCOB Endianness and
 * Multi-Byte Access : The FCCOB register group uses a big endian addressing
 * convention. For all command parameter fields larger than 1 byte, the most significant
 * data resides in the lowest FCCOB register number. The FCCOB register group may
 * be read and written as individual bytes, aligned words (2 bytes) or aligned
 * longwords (4 bytes).
 */
/*@{*/
#define BP_FTFL_FCCOB9_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB9_CCOBn. */
#define BM_FTFL_FCCOB9_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB9_CCOBn. */
#define BS_FTFL_FCCOB9_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB9_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB9_CCOBn field. */
#define BR_FTFL_FCCOB9_CCOBn(x) (HW_FTFL_FCCOB9(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB9_CCOBn. */
#define BF_FTFL_FCCOB9_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB9_CCOBn) & BM_FTFL_FCCOB9_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB9_CCOBn(x, v) (HW_FTFL_FCCOB9_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCCOB8 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCCOB8 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
typedef union _hw_ftfl_fccob8
{
    uint8_t U;
    struct _hw_ftfl_fccob8_bitfields
    {
        uint8_t CCOBn : 8;             /*!< [7:0]  */
    } B;
} hw_ftfl_fccob8_t;

/*!
 * @name Constants and macros for entire FTFL_FCCOB8 register
 */
/*@{*/
#define HW_FTFL_FCCOB8_ADDR(x)   ((uintptr_t)(x) + 0xFU)

#define HW_FTFL_FCCOB8(x)        (*(__IO hw_ftfl_fccob8_t *) HW_FTFL_FCCOB8_ADDR(x))
#define HW_FTFL_FCCOB8_RD(x)     (HW_FTFL_FCCOB8(x).U)
#define HW_FTFL_FCCOB8_WR(x, v)  (HW_FTFL_FCCOB8(x).U = (v))
#define HW_FTFL_FCCOB8_SET(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) |  (v)))
#define HW_FTFL_FCCOB8_CLR(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) & ~(v)))
#define HW_FTFL_FCCOB8_TOG(x, v) (HW_FTFL_FCCOB8_WR(x, HW_FTFL_FCCOB8_RD(x) ^  (v)))
/*@}*/

