smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*******************************************************************************
 * HW_MCG_C9 - MCG Control 9 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C9 - MCG Control 9 Register (ROZ)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_c9
{
    uint8_t U;
    struct _hw_mcg_c9_bitfields
    {
        uint8_t RESERVED0 : 8;         /*!< [7:0]  */
    } B;
} hw_mcg_c9_t;

/*!
 * @name Constants and macros for entire MCG_C9 register
 */
/*@{*/
#define HW_MCG_C9_ADDR(x)        ((uintptr_t)(x) + 0xEU)

#define HW_MCG_C9(x)             (*(__I hw_mcg_c9_t *) HW_MCG_C9_ADDR(x))
#define HW_MCG_C9_RD(x)          (HW_MCG_C9(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_C9 bitfields
 */

/*******************************************************************************
 * HW_MCG_C10 - MCG Control 10 Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_C10 - MCG Control 10 Register (ROZ)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_c10
{
    uint8_t U;
    struct _hw_mcg_c10_bitfields
    {
        uint8_t RESERVED0 : 8;         /*!< [7:0]  */
    } B;
} hw_mcg_c10_t;

/*!
 * @name Constants and macros for entire MCG_C10 register
 */
/*@{*/
#define HW_MCG_C10_ADDR(x)       ((uintptr_t)(x) + 0xFU)

#define HW_MCG_C10(x)            (*(__I hw_mcg_c10_t *) HW_MCG_C10_ADDR(x))
#define HW_MCG_C10_RD(x)         (HW_MCG_C10(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_C10 bitfields
 */

/*******************************************************************************
 * hw_mcg_t - module struct
 ******************************************************************************/
/*!
 * @brief All MCG module registers.
 */
#pragma pack(1)
typedef struct _hw_mcg
{
    __IO hw_mcg_c1_t C1;                   /*!< [0x0] MCG Control 1 Register */
    __IO hw_mcg_c2_t C2;                   /*!< [0x1] MCG Control 2 Register */
    __IO hw_mcg_c3_t C3;                   /*!< [0x2] MCG Control 3 Register */
    __IO hw_mcg_c4_t C4;                   /*!< [0x3] MCG Control 4 Register */
    __IO hw_mcg_c5_t C5;                   /*!< [0x4] MCG Control 5 Register */
    __IO hw_mcg_c6_t C6;                   /*!< [0x5] MCG Control 6 Register */
    __IO hw_mcg_s_t S;                     /*!< [0x6] MCG Status Register */
    uint8_t _reserved0[1];
    __IO hw_mcg_sc_t SC;                   /*!< [0x8] MCG Status and Control Register */
    uint8_t _reserved1[1];
    __IO hw_mcg_atcvh_t ATCVH;             /*!< [0xA] MCG Auto Trim Compare Value High Register */
    __IO hw_mcg_atcvl_t ATCVL;             /*!< [0xB] MCG Auto Trim Compare Value Low Register */
    __IO hw_mcg_c7_t C7;                   /*!< [0xC] MCG Control 7 Register */
    __IO hw_mcg_c8_t C8;                   /*!< [0xD] MCG Control 8 Register */
    __I hw_mcg_c9_t C9;                    /*!< [0xE] MCG Control 9 Register */
    __I hw_mcg_c10_t C10;                  /*!< [0xF] MCG Control 10 Register */
} hw_mcg_t;
#pragma pack()

/*! @brief Macro to access all MCG registers. */
/*! @param x MCG module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_MCG_REGS(MCG_BASE)</code>. */
#define HW_MCG_REGS(x) (*(hw_mcg_t *)(x))

/* MCG C2, EREFS Backward compatibility */
#define BP_MCG_C2_EREFS          BP_MCG_C2_EREFS0
#define BM_MCG_C2_EREFS          BM_MCG_C2_EREFS0
#define BS_MCG_C2_EREFS          BS_MCG_C2_EREFS0
#define BR_MCG_C2_EREFS(x)       BR_MCG_C2_EREFS0(x)
#define BF_MCG_C2_EREFS(v)       BF_MCG_C2_EREFS0(v)
#define BW_MCG_C2_EREFS(x, v)    BW_MCG_C2_EREFS0(x, v)
/* MCG C2, HGO Backward compatibility */
#define BP_MCG_C2_HGO          BP_MCG_C2_HGO0
#define BM_MCG_C2_HGO          BM_MCG_C2_HGO0
#define BS_MCG_C2_HGO          BS_MCG_C2_HGO0
#define BR_MCG_C2_HGO(x)       BR_MCG_C2_HGO0(x)
#define BF_MCG_C2_HGO(v)       BF_MCG_C2_HGO0(v)
#define BW_MCG_C2_HGO(x, v)    BW_MCG_C2_HGO0(x, v)
/* MCG C2, RANGE Backward compatibility */
#define BP_MCG_C2_RANGE          BP_MCG_C2_RANGE0
#define BM_MCG_C2_RANGE          BM_MCG_C2_RANGE0
#define BS_MCG_C2_RANGE          BS_MCG_C2_RANGE0
#define BR_MCG_C2_RANGE(x)       BR_MCG_C2_RANGE0(x)
#define BF_MCG_C2_RANGE(v)       BF_MCG_C2_RANGE0(v)
#define BW_MCG_C2_RANGE(x, v)    BW_MCG_C2_RANGE0(x, v)

/*
 * MKW24D5 MCM
 *
 * Core Platform Miscellaneous Control Module
 *
 * Registers defined in this header file:
 * - HW_MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 * - HW_MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration
 * - HW_MCM_PLACR - Crossbar Switch (AXBS) Control Register
 *
 * - hw_mcm_t - Struct containing all module registers.
 */

#define HW_MCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MCM module. */
#define HW_MCM (0U) /*!< Instance number for MCM. */

/*******************************************************************************
 * HW_MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 ******************************************************************************/

/*!
 * @brief HW_MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration (RO)
 *
 * Reset value: 0x000FU
 *
 * PLASC is a 16-bit read-only register identifying the presence/absence of bus
 * slave connections to the device's crossbar switch.
 */
typedef union _hw_mcm_plasc
{
    uint16_t U;
    struct _hw_mcm_plasc_bitfields
    {
        uint16_t ASC : 8;              /*!< [7:0] Each bit in the ASC field indicates
                                        * whether there is a corresponding connection to the crossbar switch's slave
                                        * input port. */
        uint16_t RESERVED0 : 8;        /*!< [15:8]  */
    } B;
} hw_mcm_plasc_t;

/*!
 * @name Constants and macros for entire MCM_PLASC register
 */
/*@{*/
#define HW_MCM_PLASC_ADDR(x)     ((uintptr_t)(x) + 0x8U)

#define HW_MCM_PLASC(x)          (*(__I hw_mcm_plasc_t *) HW_MCM_PLASC_ADDR(x))
#define HW_MCM_PLASC_RD(x)       (HW_MCM_PLASC(x).U)
/*@}*/

