smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW24D5/MKW24D5_registers.h
/*******************************************************************************
 * HW_RTC_MCLR - RTC Monotonic Counter Low Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_MCLR - RTC Monotonic Counter Low Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_rtc_mclr
{
    uint32_t U;
    struct _hw_rtc_mclr_bitfields
    {
        uint32_t MCL : 32;             /*!< [31:0] Monotonic Counter Low */
    } B;
} hw_rtc_mclr_t;

/*!
 * @name Constants and macros for entire RTC_MCLR register
 */
/*@{*/
#define HW_RTC_MCLR_ADDR(x)      ((uintptr_t)(x) + 0x28U)

#define HW_RTC_MCLR(x)           (*(__IO hw_rtc_mclr_t *) HW_RTC_MCLR_ADDR(x))
#define HW_RTC_MCLR_RD(x)        (HW_RTC_MCLR(x).U)
#define HW_RTC_MCLR_WR(x, v)     (HW_RTC_MCLR(x).U = (v))
#define HW_RTC_MCLR_SET(x, v)    (HW_RTC_MCLR_WR(x, HW_RTC_MCLR_RD(x) |  (v)))
#define HW_RTC_MCLR_CLR(x, v)    (HW_RTC_MCLR_WR(x, HW_RTC_MCLR_RD(x) & ~(v)))
#define HW_RTC_MCLR_TOG(x, v)    (HW_RTC_MCLR_WR(x, HW_RTC_MCLR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual RTC_MCLR bitfields
 */

/*!
 * @name Register RTC_MCLR, field MCL[31:0] (RW)
 *
 * When the time invalid flag is set, the monotonic counter is held in reset.
 * When the monotonic counter enable is clear, a write to this register will load
 * the counter with the value written. When the monotonic counter enable is set, a
 * write to this register will cause it to increment. A write to monotonic
 * counter low that causes it to overflow will also increment monotonic counter high.
 */
/*@{*/
#define BP_RTC_MCLR_MCL      (0U)          /*!< Bit position for RTC_MCLR_MCL. */
#define BM_RTC_MCLR_MCL      (0xFFFFFFFFU) /*!< Bit mask for RTC_MCLR_MCL. */
#define BS_RTC_MCLR_MCL      (32U)         /*!< Bit field size in bits for RTC_MCLR_MCL. */

/*! @brief Read current value of the RTC_MCLR_MCL field. */
#define BR_RTC_MCLR_MCL(x)   (HW_RTC_MCLR(x).U)

/*! @brief Format value for bitfield RTC_MCLR_MCL. */
#define BF_RTC_MCLR_MCL(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_MCLR_MCL) & BM_RTC_MCLR_MCL)

/*! @brief Set the MCL field to a new value. */
#define BW_RTC_MCLR_MCL(x, v) (HW_RTC_MCLR_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_RTC_MCHR - RTC Monotonic Counter High Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_MCHR - RTC Monotonic Counter High Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_rtc_mchr
{
    uint32_t U;
    struct _hw_rtc_mchr_bitfields
    {
        uint32_t MCH : 32;             /*!< [31:0] Monotonic Counter High */
    } B;
} hw_rtc_mchr_t;

/*!
 * @name Constants and macros for entire RTC_MCHR register
 */
/*@{*/
#define HW_RTC_MCHR_ADDR(x)      ((uintptr_t)(x) + 0x2CU)

#define HW_RTC_MCHR(x)           (*(__IO hw_rtc_mchr_t *) HW_RTC_MCHR_ADDR(x))
#define HW_RTC_MCHR_RD(x)        (HW_RTC_MCHR(x).U)
#define HW_RTC_MCHR_WR(x, v)     (HW_RTC_MCHR(x).U = (v))
#define HW_RTC_MCHR_SET(x, v)    (HW_RTC_MCHR_WR(x, HW_RTC_MCHR_RD(x) |  (v)))
#define HW_RTC_MCHR_CLR(x, v)    (HW_RTC_MCHR_WR(x, HW_RTC_MCHR_RD(x) & ~(v)))
#define HW_RTC_MCHR_TOG(x, v)    (HW_RTC_MCHR_WR(x, HW_RTC_MCHR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual RTC_MCHR bitfields
 */

/*!
 * @name Register RTC_MCHR, field MCH[31:0] (RW)
 *
 * When the time invalid flag is set, the monotonic counter is held in reset.
 * When the monotonic counter enable is clear, a write to this register will load
 * the counter with the value written. When the monotonic counter enable is set, a
 * write to this register will cause it to increment. A write to monotonic
 * counter low that causes it to overflow will also increment monotonic counter high.
 */
/*@{*/
#define BP_RTC_MCHR_MCH      (0U)          /*!< Bit position for RTC_MCHR_MCH. */
#define BM_RTC_MCHR_MCH      (0xFFFFFFFFU) /*!< Bit mask for RTC_MCHR_MCH. */
#define BS_RTC_MCHR_MCH      (32U)         /*!< Bit field size in bits for RTC_MCHR_MCH. */

/*! @brief Read current value of the RTC_MCHR_MCH field. */
#define BR_RTC_MCHR_MCH(x)   (HW_RTC_MCHR(x).U)

/*! @brief Format value for bitfield RTC_MCHR_MCH. */
#define BF_RTC_MCHR_MCH(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_MCHR_MCH) & BM_RTC_MCHR_MCH)

/*! @brief Set the MCH field to a new value. */
#define BW_RTC_MCHR_MCH(x, v) (HW_RTC_MCHR_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_RTC_WAR - RTC Write Access Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_WAR - RTC Write Access Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
typedef union _hw_rtc_war
{
    uint32_t U;
    struct _hw_rtc_war_bitfields
    {
        uint32_t TSRW : 1;             /*!< [0] Time Seconds Register Write */
        uint32_t TPRW : 1;             /*!< [1] Time Prescaler Register Write */
        uint32_t TARW : 1;             /*!< [2] Time Alarm Register Write */
        uint32_t TCRW : 1;             /*!< [3] Time Compensation Register Write */
        uint32_t CRW : 1;              /*!< [4] Control Register Write */
        uint32_t SRW : 1;              /*!< [5] Status Register Write */
        uint32_t LRW : 1;              /*!< [6] Lock Register Write */
        uint32_t IERW : 1;             /*!< [7] Interrupt Enable Register Write */
        uint32_t TTSW : 1;             /*!< [8] Tamper Time Seconds Write */
        uint32_t MERW : 1;             /*!< [9] Monotonic Enable Register Write */
        uint32_t MCLW : 1;             /*!< [10] Monotonic Counter Low Write */
        uint32_t MCHW : 1;             /*!< [11] Monotonic Counter High Write */
        uint32_t RESERVED0 : 20;       /*!< [31:12]  */
    } B;
} hw_rtc_war_t;

/*!
 * @name Constants and macros for entire RTC_WAR register
 */
/*@{*/
#define HW_RTC_WAR_ADDR(x)       ((uintptr_t)(x) + 0x800U)

#define HW_RTC_WAR(x)            (*(__IO hw_rtc_war_t *) HW_RTC_WAR_ADDR(x))
#define HW_RTC_WAR_RD(x)         (HW_RTC_WAR(x).U)
#define HW_RTC_WAR_WR(x, v)      (HW_RTC_WAR(x).U = (v))
#define HW_RTC_WAR_SET(x, v)     (HW_RTC_WAR_WR(x, HW_RTC_WAR_RD(x) |  (v)))
#define HW_RTC_WAR_CLR(x, v)     (HW_RTC_WAR_WR(x, HW_RTC_WAR_RD(x) & ~(v)))
#define HW_RTC_WAR_TOG(x, v)     (HW_RTC_WAR_WR(x, HW_RTC_WAR_RD(x) ^  (v)))
/*@}*/

